weather-site/public/ieee754.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2026-07-17 Fri 20:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Conversión a IEEE 754</title>
<meta name="author" content="Mateo Jami" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Conversión a IEEE 754</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org311bc02">1. 1. Introducción Teórica</a></li>
<li><a href="#org3edfd55">2. 2. Estructura Matemática y Limitaciones</a></li>
<li><a href="#org93d9737">3. 3. Pasos Lógicos de Resolución (Ej: -248.75)</a></li>
<li><a href="#org881c984">4. 4. Lógica e Implementación Interactiva en Python</a></li>
<li><a href="#orgf72583f">5. 5. Demostración de Funcionalidad</a></li>
<li><a href="#orgc4cb90d">6. 6. Conversor Interactivo (Frontend)</a></li>
</ul>
</div>
</div>
<p>
<a href="index.html">Volver a la página principal</a>
</p>

<div id="outline-container-org311bc02" class="outline-2">
<h2 id="org311bc02"><span class="section-number-2">1.</span> 1. Introducción Teórica</h2>
<div class="outline-text-2" id="text-1">
<p>
En la computación, representaciones tradicionales como la coma fija o el complemento a 2 son excelentes para números enteros, pero no permiten representar números muy grandes o muy pequeños, como por ejemplo, el diámetro de la Tierra. Para solucionar esto, utilizamos la representación en coma flotante, regida mundialmente por el estándar IEEE 754.
</p>

<p>
En nuestra vida cotidiana utilizamos el Sistema Decimal (base 10). Sin embargo, el procesador, y específicamente la Unidad Aritmética Lógica (ALU), solo comprende señales eléctricas representadas en el Sistema Binario (base 2). El estándar IEEE 754 nos permite tomar un número decimal con fracciones y convertirlo a una estructura binaria estandarizada. En este proyecto trabajaremos con precisión simple (32 bits).
</p>
</div>
</div>

<div id="outline-container-org3edfd55" class="outline-2">
<h2 id="org3edfd55"><span class="section-number-2">2.</span> 2. Estructura Matemática y Limitaciones</h2>
<div class="outline-text-2" id="text-2">
<p>
La expresión general para la representación en coma flotante binaria es la versión informática de la notación científica tradicional:
</p>

<p>
\[
\pm S \times B^{\pm E}
\]
</p>

<p>
Desglosando esta expresión bajo el estándar de 32 bits:
</p>
<ul class="org-ul">
<li><b><b>\(\pm\) (Signo, 1 bit):</b></b> Determina si el número es positivo (\(0\)) o negativo (\(1\)).</li>
<li><b><b>\(S\) (Mantisa, 23 bits):</b></b> Representa los dígitos de precisión. Se normaliza para obligar a que el número adquiera la forma \(1.bbb...b\).</li>
<li><b><b>\(B\) (Base):</b></b> En el mundo de la ALU, la base siempre será \(2\).</li>
<li><b><b>\(\pm E\) (Exponente, 8 bits):</b></b> Posee una representación sesgada para evitar exponentes binarios negativos. Se le suma un valor fijo llamado sesgo (BIAS), que para 32 bits es de \(127\).</li>
</ul>

<p>
La expresión matemática fundamental que condensa el estándar y permite regresar de IEEE 754 a decimal es:
</p>

<p>
\[
(-1)^s \times 1.m \times 2^{e-127}
\]
</p>

<p>
<b><b>Limitaciones del Estándar:</b></b>
Al tener un espacio finito de 32 bits, existen huecos de precisión y límites estrictos:
</p>
<ul class="org-ul">
<li><b><b>Límites Positivos:</b></b> Desde \(2^{-127}\) hasta \((2 - 2^{-23}) \times 2^{128}\).</li>
<li><b><b>Límites Negativos:</b></b> Desde \(-(2 - 2^{-23}) \times 2^{128}\) hasta \(-2^{-127}\).</li>
</ul>

<p>
Exceder estos límites genera errores de <b>Overflow</b> o <b>Underflow</b>. También existen representaciones especiales como \(0^+\), \(0^-\), infinito (\(+\infty\), \(-\infty\)) y el estado <b>NaN</b> (Not a Number).
</p>
</div>
</div>

<div id="outline-container-org93d9737" class="outline-2">
<h2 id="org93d9737"><span class="section-number-2">3.</span> 3. Pasos Lógicos de Resolución (Ej: -248.75)</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><b><b>Identificar el bit de signo:</b></b> Como \(-248.75\) es negativo, el bit es \(1\).</li>
<li><b><b>Convertir a binario sin signo:</b></b> La parte entera (\(248\)) y la fraccionaria (\(0.75\)) nos dan \(11111000.11\).</li>
<li><b><b>Normalización:</b></b> Movemos la coma \(7\) espacios a la izquierda para dejar un solo \(1\): \(1.111100011 \times 2^7\).</li>
<li><b><b>Ajustar el sesgo:</b></b> Al exponente (\(7\)) le sumamos \(127\), resultando en \(134\).</li>
<li><b><b>Convertir el exponente:</b></b> \(134\) en binario de 8 bits es \(10000110\).</li>
<li><b><b>Construir la mantisa:</b></b> Tomamos los bits a la derecha de la coma (\(111100011\)).</li>
<li><b><b>Completar con ceros:</b></b> Llenamos a la derecha hasta los \(23\) bits.</li>
</ol>
<p>
Resultado final: <code>1 10000110 11110001100000000000000</code>
</p>
</div>
</div>
