weather-site/public/ieee754.html

<div id="outline-container-org881c984" class="outline-2">
<h2 id="org881c984"><span class="section-number-2">4.</span> 4. Lógica e Implementación Interactiva en Python</h2>
<div class="outline-text-2" id="text-4">
<p>
Para cumplir con los requerimientos de interacción sin detener la compilación de la página HTML, el siguiente código utiliza el concepto de <b>Tangling</b>. Al compilar el sitio web, Emacs exportará automáticamente este código a un archivo llamado <code>conversor_ieee754.py</code> que podrá ejecutarse desde cualquier terminal.
</p>

<p>
El script incluye un bucle <code>while</code> infinito que evalúa mediante un <code>try-except</code> si el número ingresado por el usuario cumple con los límites de 32 bits predefinidos. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">obtener_signo</span>(numero):
    <span style="font-style: italic;">"""Devuelve '1' si es negativo, '0' si es positivo."""</span>
    <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"1"</span> <span style="font-weight: bold;">if</span> numero &lt; 0 <span style="font-weight: bold;">else</span> <span style="font-style: italic;">"0"</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">entero_a_binario</span>(entero):
    <span style="font-style: italic;">"""Convierte la parte entera a binario dividiendo sucesivamente para 2."""</span>
    <span style="font-weight: bold;">if</span> entero == 0: <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"0"</span>
    <span style="font-weight: bold; font-style: italic;">binario</span> = <span style="font-style: italic;">""</span>
    <span style="font-weight: bold;">while</span> entero &gt; 0:
        <span style="font-weight: bold; font-style: italic;">binario</span> = <span style="font-weight: bold;">str</span>(entero % 2) + binario
        <span style="font-weight: bold; font-style: italic;">entero</span> = entero // 2
    <span style="font-weight: bold;">return</span> binario

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">fraccion_a_binario</span>(fraccion, precision=50):
    <span style="font-style: italic;">"""Multiplica sucesivamente la fracci&#243;n por 2 para extraer los bits."""</span>
    <span style="font-weight: bold; font-style: italic;">binario</span> = <span style="font-style: italic;">""</span>
    <span style="font-weight: bold;">while</span> fraccion &gt; 0 <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">len</span>(binario) &lt; precision:
        <span style="font-weight: bold; font-style: italic;">fraccion</span> *= 2
        <span style="font-weight: bold; font-style: italic;">bit</span> = <span style="font-weight: bold;">int</span>(fraccion)
        <span style="font-weight: bold; font-style: italic;">binario</span> += <span style="font-weight: bold;">str</span>(bit)
        <span style="font-weight: bold; font-style: italic;">fraccion</span> -= bit
    <span style="font-weight: bold;">return</span> binario <span style="font-weight: bold;">if</span> binario <span style="font-weight: bold;">else</span> <span style="font-style: italic;">"0"</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">normalizar_y_exponente</span>(binario_entero, binario_fraccion):
    <span style="font-style: italic;">"""Desplaza la coma, calcula el exponente sesgado y ajusta la mantisa a 23 bits."""</span>
    <span style="font-weight: bold;">if</span> binario_entero == <span style="font-style: italic;">"0"</span> <span style="font-weight: bold;">and</span> <span style="font-style: italic;">"1"</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">in</span> binario_fraccion:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"00000000"</span>, <span style="font-style: italic;">"0"</span> * 23

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Desplazamiento de la coma
</span>    <span style="font-weight: bold;">if</span> binario_entero != <span style="font-style: italic;">"0"</span>:
        <span style="font-weight: bold; font-style: italic;">exponente</span> = <span style="font-weight: bold;">len</span>(binario_entero) - 1
        <span style="font-weight: bold; font-style: italic;">mantisa_cruda</span> = binario_entero[1:] + binario_fraccion
    <span style="font-weight: bold;">else</span>:
        <span style="font-weight: bold; font-style: italic;">indice_uno</span> = binario_fraccion.find(<span style="font-style: italic;">"1"</span>)
        <span style="font-weight: bold; font-style: italic;">exponente</span> = -(indice_uno + 1)
        <span style="font-weight: bold; font-style: italic;">mantisa_cruda</span> = binario_fraccion[indice_uno + 1:]

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Suma del sesgo (127) y formato
</span>    <span style="font-weight: bold; font-style: italic;">bin_exponente</span> = <span style="font-weight: bold;">bin</span>(exponente + 127)[2:].zfill(8)
    <span style="font-weight: bold; font-style: italic;">mantisa_final</span> = mantisa_cruda.ljust(23, <span style="font-style: italic;">'0'</span>)[:23]

    <span style="font-weight: bold;">return</span> bin_exponente, mantisa_final

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">convertir_a_ieee754</span>(numero):
    <span style="font-style: italic;">"""Ensambla el Signo, Exponente y Mantisa."""</span>
    <span style="font-weight: bold;">if</span> numero == 0.0:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"0 00000000 00000000000000000000000"</span>

    <span style="font-weight: bold; font-style: italic;">signo</span> = obtener_signo(numero)
    <span style="font-weight: bold; font-style: italic;">num_abs</span> = <span style="font-weight: bold;">abs</span>(numero)
    <span style="font-weight: bold; font-style: italic;">entero</span> = <span style="font-weight: bold;">int</span>(num_abs)
    <span style="font-weight: bold; font-style: italic;">fraccion</span> = num_abs - entero

    <span style="font-weight: bold; font-style: italic;">bin_entero</span> = entero_a_binario(entero)
    <span style="font-weight: bold; font-style: italic;">bin_fraccion</span> = fraccion_a_binario(fraccion)

    <span style="font-weight: bold; font-style: italic;">exponente</span>, <span style="font-weight: bold; font-style: italic;">mantisa</span> = normalizar_y_exponente(bin_entero, bin_fraccion)
    <span style="font-weight: bold;">return</span> f<span style="font-style: italic;">"</span>{signo}<span style="font-style: italic;"> </span>{exponente}<span style="font-style: italic;"> </span>{mantisa}<span style="font-style: italic;">"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">consola_interactiva</span>():
    <span style="font-style: italic;">"""Bucle principal de validaci&#243;n y captura de datos por consola."""</span>
    <span style="font-weight: bold; font-style: italic;">MAX_FLOAT_32</span> = 3.4028235e38
    <span style="font-weight: bold; font-style: italic;">MIN_FLOAT_32</span> = 1.17549435e-38

    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"--- Conversor Decimal a IEEE 754 (32 bits) ---"</span>)
    <span style="font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
        <span style="font-weight: bold; font-style: italic;">entrada</span> = <span style="font-weight: bold;">input</span>(<span style="font-style: italic;">"Ingrese un numero decimal (o 'q' para salir): "</span>)
        <span style="font-weight: bold;">if</span> entrada.lower() == <span style="font-style: italic;">'q'</span>:
            <span style="font-weight: bold;">break</span>
        <span style="font-weight: bold;">try</span>:
            <span style="font-weight: bold; font-style: italic;">numero</span> = <span style="font-weight: bold;">float</span>(entrada)
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Validaci&#243;n estricta del rango
</span>            <span style="font-weight: bold;">if</span> numero != 0.0 <span style="font-weight: bold;">and</span> (<span style="font-weight: bold;">abs</span>(numero) &gt; MAX_FLOAT_32 <span style="font-weight: bold;">or</span> <span style="font-weight: bold;">abs</span>(numero) &lt; MIN_FLOAT_32):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Error: El numero excede los limites de 32 bits (Overflow/Underflow). Intente de nuevo.</span><span style="font-weight: bold; text-decoration: underline;">\n</span><span style="font-style: italic;">"</span>)
                <span style="font-weight: bold;">continue</span>

            <span style="font-weight: bold; font-style: italic;">resultado</span> = convertir_a_ieee754(numero)
            <span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"IEEE 754: </span>{resultado}<span style="font-weight: bold; text-decoration: underline;">\n</span><span style="font-style: italic;">"</span>)
        <span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span>:
            <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Error: Ingrese un valor numerico valido.</span><span style="font-weight: bold; text-decoration: underline;">\n</span><span style="font-style: italic;">"</span>)

<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">__name__</span> == <span style="font-style: italic;">"__main__"</span>:
    consola_interactiva()
</pre>
</div>
</div>
</div>
