weather-site/content/ieee754.org
* 5. Demostración de Funcionalidad
Dado que la web actúa como un documento estático, a continuación se presentan los resultados directos de la ejecución del algoritmo de conversión para comprobar su fiabilidad con datos de prueba:

#+begin_src python :session :results output :exports both
# Se realiza una prueba emulando los datos de la función extraída en el Tangle
numeros_de_prueba = [-248.75, 2.0, 0.085]

for num in numeros_de_prueba:
    print(f"Decimal: {num}")
    print(f"IEEE 754: {convertir_a_ieee754(num)}\n")
#+end_src

#+RESULTS:
: Decimal: -248.75
: IEEE 754: 1 10000110 11110001100000000000000
: 
: Decimal: 2.0
: IEEE 754: 0 10000000 00000000000000000000000
: 
: Decimal: 0.085
: IEEE 754: 0 01111011 01011100001010001111010

* 6. Conversor Interactivo (Frontend)
A continuación, puedes probar la conversión directamente en la página web. 

#+begin_export html
<div style="background-color: #f4f4f4; padding: 20px; border-radius: 8px; margin-top: 20px;">
    <label for="numeroDecimal"><strong>Ingrese un número decimal:</strong></label>
    <input type="text" id="numeroDecimal" placeholder="Ej. -248.75" style="padding: 5px; margin-left: 10px;">
    <button onclick="procesarIEEE()" style="padding: 5px 15px; cursor: pointer; background-color: #333; color: white; border: none; border-radius: 4px;">Convertir</button>
    
    <!-- Zona para mensajes al usuario -->
    <div id="mensajeUsuario" style="margin-top: 15px; font-weight: bold;"></div>
    
    <!-- Zona para el resultado exitoso -->
    <div id="resultadoBits" style="margin-top: 10px; font-family: monospace; font-size: 16px; background-color: #e8e8e8; padding: 10px; border-radius: 4px; display: none;"></div>
</div>

<script>
// --- Lógica Matemática traducida a JavaScript ---
const enteroABinario = (entero) => {
    if (entero === 0) return "0";
    let binario = "";
    while (entero > 0) {
        binario = (entero % 2).toString() + binario;
        entero = Math.floor(entero / 2);
    }
    return binario;
};

const fraccionABinario = (fraccion) => {
    let binario = "";
    let iteraciones = 0;
    while (fraccion > 0 && iteraciones < 50) {
        fraccion *= 2;
        let bit = Math.floor(fraccion);
        binario += bit.toString();
        fraccion -= bit;
        iteraciones++;
    }
    return binario === "" ? "0" : binario;
};

const normalizarYExponente = (binEntero, binFraccion) => {
    if (binEntero === "0" && !binFraccion.includes("1")) {
        return ["00000000", "0".repeat(23)];
    }
    
    let exponente = 0;
    let mantisaCruda = "";
    
    if (binEntero !== "0") {
        exponente = binEntero.length - 1;
        mantisaCruda = binEntero.substring(1) + binFraccion;
    } else {
        let indiceUno = binFraccion.indexOf("1");
        exponente = -(indiceUno + 1);
        mantisaCruda = binFraccion.substring(indiceUno + 1);
    }
    
    let exponenteSesgado = exponente + 127;
    let binExponente = exponenteSesgado.toString(2).padStart(8, '0');
    
    let mantisaFinal = mantisaCruda.padEnd(23, '0').substring(0, 23);
    return [binExponente, mantisaFinal];
};

const procesarIEEE = () => {
    const input = document.getElementById("numeroDecimal").value;
    const contenedorMensaje = document.getElementById("mensajeUsuario");
    const contenedorResultado = document.getElementById("resultadoBits");

    // Ocultar resultados previos
    contenedorResultado.style.display = "none";

    // Validación 1: Si no es un número
    if (isNaN(input) || input.trim() === "") {
        contenedorMensaje.style.color = "orange";
        contenedorMensaje.innerText = "⚠️ Advertencia: Por favor, ingresa un número decimal válido.";
        return;
    }

    const numero = parseFloat(input);

    // Validación 2: Límites de 32 bits
    const MAX_FLOAT_32 = 3.4028235e38;
    const MIN_FLOAT_32 = 1.17549435e-38;
    
    if (numero !== 0 && (Math.abs(numero) > MAX_FLOAT_32 || Math.abs(numero) < MIN_FLOAT_32)) {
        contenedorMensaje.style.color = "red";
        contenedorMensaje.innerText = "❌ Error: El número excede los límites de 32 bits (Overflow/Underflow).";
        return;
    }

    // Ejecución del algoritmo
    const signo = numero < 0 ? "1" : "0";
    const numAbs = Math.abs(numero);
    const entero = Math.floor(numAbs);
    const fraccion = numAbs - entero;

    const binEntero = enteroABinario(entero);
    const binFraccion = fraccionABinario(fraccion);
    
    const [exponente, mantisa] = normalizarYExponente(binEntero, binFraccion);
    
    // Si el número es 0, forzar todo a ceros
    const resultadoFinal = (numero === 0) 
        ? "0 00000000 00000000000000000000000" 
        : `${signo} ${exponente} ${mantisa}`;

    // Mostrar resultados
    contenedorMensaje.style.color = "green";
    contenedorMensaje.innerText = "✅ Conversión realizada con éxito.";
    
    contenedorResultado.style.display = "block";
    contenedorResultado.innerHTML = `
        <strong>Signo:</strong> ${signo} <br>
        <strong>Exponente:</strong> ${exponente} <br>
        <strong>Mantisa:</strong> ${mantisa} <br><br>
        <strong>IEEE 754:</strong> ${resultadoFinal}
    `;
};
</script>
#+end_export
